benchmark/results/wrk-bun-multi.log
== bun [multi] /hello  t=1 c=500 d=5s ==
Running 5s test @ http://127.0.0.1:3005/hello
  1 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.31ms  285.85us  11.14ms   95.12%
    Req/Sec   216.82k    10.09k  237.78k    88.24%
  Latency Distribution
     50%    2.27ms
     75%    2.34ms
     90%    2.46ms
     99%    3.33ms
  1099677 requests in 5.10s, 135.29MB read
Requests/sec: 215449.06
Transfer/sec:     26.51MB
== bun [multi] /hello  t=4 c=500 d=5s ==
Running 5s test @ http://127.0.0.1:3005/hello
  4 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.42ms  442.32us  12.27ms   91.34%
    Req/Sec    51.78k     5.10k   70.83k    81.77%
  Latency Distribution
     50%    2.34ms
     75%    2.44ms
     90%    2.70ms
     99%    3.98ms
  1046248 requests in 5.10s, 128.71MB read
Requests/sec: 205040.89
Transfer/sec:     25.22MB
== bun [multi] /hello/inon  t=1 c=500 d=5s ==
Running 5s test @ http://127.0.0.1:3005/hello/inon
  1 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.42ms  333.56us   9.92ms   95.53%
    Req/Sec   207.78k    11.50k  226.37k    92.00%
  Latency Distribution
     50%    2.37ms
     75%    2.44ms
     90%    2.57ms
     99%    3.62ms
  1033221 requests in 5.01s, 126.13MB read
Requests/sec: 206389.43
Transfer/sec:     25.19MB
== bun [multi] /hello/inon  t=4 c=500 d=5s ==
Running 5s test @ http://127.0.0.1:3005/hello/inon
  4 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.59ms    1.24ms  29.01ms   97.59%
    Req/Sec    49.71k     3.98k   56.25k    84.00%
  Latency Distribution
     50%    2.42ms
     75%    2.54ms
     90%    2.81ms
     99%    5.25ms
  989343 requests in 5.00s, 120.77MB read
Requests/sec: 197728.49
Transfer/sec:     24.14MB
== bun [multi] /db  t=1 c=500 d=5s ==
Running 5s test @ http://127.0.0.1:3005/db
  1 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.97ms  383.85us  16.17ms   94.37%
    Req/Sec   126.67k     5.86k  132.33k    94.00%
  Latency Distribution
     50%    3.93ms
     75%    4.03ms
     90%    4.18ms
     99%    5.30ms
  630060 requests in 5.00s, 108.57MB read
Requests/sec: 125895.95
Transfer/sec:     21.69MB
== bun [multi] /db  t=4 c=500 d=5s ==
Running 5s test @ http://127.0.0.1:3005/db
  4 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.14ms    1.66ms  39.48ms   98.12%
    Req/Sec    30.93k     2.47k   34.02k    88.50%
  Latency Distribution
     50%    3.95ms
     75%    4.12ms
     90%    4.39ms
     99%    7.41ms
  615417 requests in 5.01s, 106.04MB read
Requests/sec: 122952.01
Transfer/sec:     21.19MB